# Переменные предназначены для хранения данных
# Название переменной может содержать буквенные и цифровые символы, а также подчеркивания, но начинаться оно обязательно должно именно с буквы или подчеркивания
# Нельзя, чтобы название переменной совпадало с названиями ключевых команд в Python

name = 'Natalya'  # Переменным принято давать осмысленные названия. Такие, которые передавали бы суть того, что в них хранится

# Когда мы присвоим переменной имя и объект, мы можем к ней «обращаться». То есть с помощью переменной, мы можем вывести объект, который за ней стоит.

print(name)

name = 'Anna'  # Их значение может меняться в процессе работы, команды выполняются последовательно.
print(name)

# переменную следует называть исходя из сути стоящего за ней объекта, но что, если смысл не передать одним словом? В таких случаях способ названия переменной подразделяется на два стиля.

date_of_birth = 'March 1985'  # стиль Snake case, в нем для разделения слов используются нижние подчеркивания. Такой стиль написания в Python считается лидирующим, то есть программисты обычно придерживаются именно его.
dateOfBirth = 'March 1985'  # стиль Camel case. При таком стиле слова разделяются верхним регистром, то есть каждое новое слово пишется с заглавной буквы

# Оба этих стиля так или иначе направлены на то, чтобы переменные было легко читать и ориентироваться в их названиях.



